#+TITLE: org-babel --- facilitating communication between programming languages and people
#+TODO: PROPOSED(p!) TODO(t!) STARTED(s!) | DONE(d!) DEFERRED(f!) REJECTED(r!)
#+OPTIONS:    H:3 num:nil toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:nil LaTeX:nil skip:nil d:(HIDE) tags:not-in-toc
#+STARTUP: oddeven hideblocks

*** R
#+begin_src R
d
#+end_src

#+results:
| 2010-02-21 |   95 |
| 2010-02-22 |   93 |
| 2010-02-23 |   92 |
| 2010-02-24 | 91.5 |
| 2010-02-25 |   91 |
| 2010-02-26 |   92 |

#+results: shell-data
|       Date |   Kg |
|------------+------|
| 2010-02-21 | 95.0 |

NB Is it unfortunate that a named simple vector doesn't get its names
printed out with :colnames yes?

#+begin_src R :colnames yes
c(a=1,b=2)
#+end_src

#+results:
| x |
|---|
| 1 |
| 2 |

This is because a 1d vector gets turned into a table with one column,
and hence its names would be rownames, not column names. One has to
transpose the vector in R to get the desired result.

#+begin_src R :colnames yes
t(c(a=1,b=2))
#+end_src

#+results:
| a | b |
|---+---|
| 1 | 2 |

** DONE allow reference to file type results
   - State "DONE"       from "TODO"       [2010-02-09 Tue 20:29]

So files can be referenced by source code blocks

- Here's a simple example counting the size of the user's =.profile=
  file.
  
  The raw org-mode text
  
  #+begin_example 
    ,#+results: my-profile
    [[file:~/.profile][my-profile]]
    
    ,#+begin_src sh :var profile=my-profile
      wc $profile
    ,#+end_src
    
    ,#+results:
    : 22 109 675 /home/eschulte/.profile
  #+end_example
  
  Now exported to html

#+results: my-profile
  [[file:~/.profile][my-profile]]
  
  #+begin_src sh :var profile=my-profile
    wc $profile
  #+end_src
  
#+results:
  : 22 109 675 /home/eschulte/.profile
  
- Or perhaps a slightly fancier example using the =host= command to
  grab IP information for the org-mode homepage.

  The raw org-mode text

  #+begin_example 
    ,#+results: org-mode-page
    [[http://orgmode.org/][org-mode-page]]
    
    ,#+begin_src sh :var page=org-mode-page
      host $page |head -1
    ,#+end_src
    
    ,#+results:
    : http://orgmode.org/ has address 63.123.155.104
  #+end_example

  or exported to html

#+results: org-mode-page
  [[http://orgmode.org/][org-mode-page]]
  
  #+begin_src sh :var page=org-mode-page
    host $page |head -1
  #+end_src
  
#+results:
  : http://orgmode.org/ has address 63.123.155.104

*** exported to html
#+srcname: set-clojure-session-var-s1
#+begin_src clojure :session s1 :results value
(def *var* [1 2 3])
#+end_src

#+results: set-clojure-session-var-s1
: #'user/*var*


#+srcname: set-clojure-session-var-s2
#+begin_src clojure :session s2 :results value
(def *var* [3 4 5 6 7 8 9])
#+end_src

#+results: set-clojure-session-var-s2
: #'user/*var*


#+srcname: get-clojure-session-var-s1
#+begin_src clojure :session s1 :results value
(count *var*)
#+end_src

#+results: get-clojure-session-var-s1
: 3


#+srcname: get-clojure-session-var-s2
#+begin_src clojure :session s2 :results value
(count *var*)
#+end_src

#+results: get-clojure-session-var-s2
: 7

*** update -- exporting arguments with source names

We are now exporting arguments with source-block names and wrapping
source-code blocks and names in =div= which is given the
=org-src-container= class.  This allows for styling of the name and
block, and for explicit association of the name and block using css
like the following which we will apply here with an HTML block
: #+begin_html 
:   <style type="text/css"> 
:     .org-src-container {
:     border-left: 4px solid gray; /* gray bar offsetting code and name */
:     padding: 0.5em 0.5em 0.5em 1em; }
:     .org-src-container pre {
:       margin-left: 1em; }        /* indentation of code blocks w/names */
:   </style> 
: #+end_html
#+begin_html 
  <style type="text/css"> 
    .org-src-container {
    border-left: 4px solid gray; /* gray bar offsetting code and name */
    padding: 0.5em 0.5em 0.5em 1em; }
    .org-src-container pre {
      margin-left: 1em; }        /* indentation of code blocks w/names */
  </style> 
#+end_html

So, for example the following *raw* org-mode text

: #+source: fibonacci
: #+begin_src emacs-lisp :var input=0
:   (defun fib (n)
:     (if (> n 1)
:         (+ (fib (- n 1)) (fib (- n 2)))
:         1))
:   (fib input)
: #+end_src
: 
: #+results: fibonacci
: : 1
: 
: now applying our Fibonacci function
: 
: #+call: fibonacci(input=5)
: 
: #+results: fibonacci(input=5)
: : 8

exports to the following *html*

#+source: fibonacci
#+begin_src emacs-lisp :var input=0
  (defun fib (n)
    (if (> n 1)
        (+ (fib (- n 1)) (fib (- n 2)))
        1))
  (fib input)
#+end_src

#+results: fibonacci
: 1

now applying our Fibonacci function

#+call: fibonacci(input=5)

#+results: fibonacci(input=5)
: 8

*** rownames
   Perhaps add a :rownames header arg. This would be an integer
    (usually 1) which would have the effect of post-processing all the
    variables created in the R session in the following way: if the
    integer is j, set the row names to the contents of column j and
    delete column j. Perhaps it is artificial to allow this integer to
    take any value other than 1. The default would be nil which would
    mean no such behaviour.

    Actually I don't know about that. If multiple variables are passed
    in, it's not appropriate to alter them all in the same way. The
    rownames specification would normally refer to just one of the
    variables. For now maybe just say this has to be done in R. E.g.

#+TBLNAME: sample-sizes
  | collection      | size | exclude | include | exclude2 | include2 |
  |-----------------+------+---------+---------+----------+----------|
  | 58C             | 2936 |       8 |    2928 |      256 |     2680 |
  | MS              | 5852 |     771 |    5081 |      771 |     5081 |
  | NBS             | 2929 |      64 |    2865 |      402 |     2527 |
  | POBI            | 2717 |       1 |    2716 |        1 |     2716 |
  | 58C+MS+NBS+POBI |      |         |   13590 |          |    13004 |
#+TBLFM: @2$4=@2$2 - @2$3::@2$6=@2$2 - @2$5::@3$4=@3$2-@3$3::@3$6=@3$2 - @3$5::@4$4=@4$2 - @4$3::@4$6=@4$2 - @4$5::@5$4=@5$2-@5$3::@5$6=@5$2 - @5$5::@6$4=vsum(@2$4..@5$4)::@6$6=vsum(@2$6..@5$6)

#+srcname: make-size-table(size=sample-sizes)
#+begin_src R 
  rownames(size) <- size[,1]
  size <- size[,-1]
#+end_src


** DONE ensure that table ranges work
when a table range is passed to org-babel as an argument, it should be
interpreted as a vector.

| 1 | 2 | simple       |
| 2 | 3 | Fixnum:1     |
| 3 | 4 | Array:123456 |
| 4 | 5 |              |
| 5 | 6 |              |
| 6 | 7 |              |
#+TBLFM: @1$3='(sbe simple-sbe-example (n 4))::@2$3='(sbe task-table-range (n @1$1..@6$1))::@3$3='(sbe task-table-range (n (@1$1..@6$1)))

#+srcname: simple-sbe-example
#+begin_src emacs-lisp 
"simple"
#+end_src

#+srcname: task-table-range
#+begin_src ruby :var n=simple-sbe-example
"#{n.class}:#{n}"
#+end_src

#+srcname: simple-results
#+begin_src emacs-lisp :var n=task-table-range(n=(1 2 3))
n
#+end_src

#+resname: simple-results
: Array:123

#+srcname: task-arr-referent
#+begin_src ruby :var ar=(1 2 3)
ar.size
#+end_src

#+resname: task-arr-referent
: 3

*** DONE perl
    - State "DONE"       from "TODO"       [2010-03-01 Mon 05:22]
This could probably be added to [[file:lisp/org-babel-script.el][org-babel-script.el]]

It has been implemented on its own (for external process only). I
think org-babel-script.el may be obsolete now.

#+begin_src perl
  $a = "1 2 3";
  split " ", $a;
#+end_src

#+results:
| 1 |
| 2 |
| 3 |

** TODO Newlines etc in table cells mess up table formatting 
   - State "TODO"       from ""           [2010-03-16 Tue 23:36]

     Perhaps we should remove or protect characters like {\n,\r,\f,\v}
     when they occur in table cells.

#+begin_src R :colnames yes
  data.frame(numbers=1:10, strings=c(letters[1:9], "an entry with a
  newline character"))
#+end_src

#+results:
| numbers       strings |
|-----------------------|
| 1     a               |
| 2     b               |
| 3     c               |
| 4     d               |
| 5     e               |
| 6     f               |
| 7     g               |
| 8     h               |
| 9     i               |
| 10    an entry with a |
| newline character     |

** PROPOSED Revisit field delimiter behaviour
   - State "PROPOSED"   from ""           [2010-02-21 Sun 01:04]

     The table below might be considered not to be the desired table,
     in that it should perhaps have had just one column.

#+begin_src R :results value
  c(date(), system("hostname", intern=TRUE), getwd())
#+end_src

#+results:
| Sun                 | Feb | 21 | 01:05:13 | 2010 |
| Luscinia            |     |    |          |      |
| /home/dan/babel-dev |     |    |          |      |

*** PROPOSED shell different results for :session and external process
   - State "PROPOSED"   from "TODO"       [2010-02-25 Thu 16:58]
   - State "TODO"       from ""           [2010-02-19 Fri 13:27]
     
#+begin_src sh :session yes
  echo 1
  echo 2
#+end_src

#+results:
: 2

But without :session this gives

#+begin_src sh
  echo 1
  echo 2
#+end_src

#+results:
| 1 |
| 2 |
*** TODO python 'session output' evaluation is not outputting last line 
   - State "TODO"       from "PROPOSED"   [2010-02-25 Thu 18:13]
   This is a bit weird. The first evaluation in a session is OK, but
   second and subsequent evaluations fail to output the last line.
   
#+begin_src python :session newsession :results output
  print 'hello'
  print 'bye'
#+end_src

#+results:
: hello
: bye

But evaluate it again and the second line will not be output.
** DONE python :session :results value not working
   - State "DONE"       from "TODO"       [2010-02-25 Thu 16:59]
   - State "TODO"       from ""           [2010-02-18 Thu 17:49]

     22fc3b2d333e0d440cdc972a6478a834180b188d
     and
     f19692578a958d42fb03048e574949231a83c2f7
     
#+begin_src python :results value :session
import os, time
[time.ctime(), os.uname(),os.getcwd()]
#+end_src

#+results:
| Thu Feb 25 16:59:00 2010 | (Linux Luscinia 2.6.31-19-generic #56-Ubuntu SMP Thu Jan 28 01:26:53 UTC 2010 i686) | /home/dan/babel-dev |

*** commit
commit 22fc3b2d333e0d440cdc972a6478a834180b188d
Author: Dan Davison <davison@stats.ox.ac.uk>
Date:   Fri Feb 19 11:34:16 2010 -0500

    babel: Fix unquoting of strings
    
    Before this change we have
    
     #+begin_src ruby :results value :session
     ["1", "3"]
     #+end_src
    
     #+results:
     : 1", "3
    
     After, we have
    
     #+begin_src ruby :results value :session
     ["1", "3"]
     #+end_src
    
     #+results:
     | 1 | 3 |

****** local
#+begin_src python :session python-local :dir /home/dan :noweb yes :results output
  <<dir-test-python>>
#+end_src

#+results:
: Tue Feb 23 22:24:46 2010
: ('Linux', 'Luscinia', '2.6.31-19-generic', '#56-Ubuntu SMP Thu Jan 28 01:26:53 UTC 2010', 'i686')
: /home/dan/babel-dev
**** tree 1

#+srcname: foo
#+begin_src R
  a <- 1
#+end_src

#+results: foo
: 1

** DONE Insert results fails if eob or ensuing lines non-empty
This (end of buffer after block, with or without newline after
"end_src") fails with "End of buffer"
#+begin_src sh
  echo output
#+end_src

This
#+begin_src sh
  echo output
#+end_src
text here

results in

t#+results:
: output
ext here

My working suggestion is this (branch results-insert-bug)

#+begin_example 
commit 0ab4b84375060e750764347b3335f110b2bfee20
Author: Dan Davison <davison@stats.ox.ac.uk>
Date:   Fri Nov 27 14:03:25 2009 -0500

    org-babel: Fix insertion of new results
    
    Insertion of new results was failing if the block was followed by
    end-of-buffer. Also, if the block was followed by non-empty lines, the
    \#+resname was being inserted away from column 0.

diff --git a/contrib/babel/lisp/org-babel.el b/contrib/babel/lisp/org-babel.el
index 0b68be3..9e7e038 100644
--- a/contrib/babel/lisp/org-babel.el
+++ b/contrib/babel/lisp/org-babel.el
@@ -639,7 +639,8 @@ following the source block."
                                  (looking-at (concat org-babel-result-regexp "\n"))))
                          ;; or (with optional insert) back up and make one ourselves
                           (when insert
-                            (goto-char end) (forward-char 1)
+                            (goto-char end)
+                           (insert "\n")
                             (insert (concat "#+results" (if hash (concat "["hash"]"))
                                             ":"(if name (concat " " name)) "\n"))
                             (move-beginning-of-line 0)
#+end_example

This certainly fixes the issue above but has the effect of inserting
additional newlines with each repeat evaluation eliminating
idempotency of source block evaluation.  For example with the above
patch applied evaluate the following 10 times

#+begin_src emacs-lisp
  (+ 1 1)
#+end_src

#+results:
: 2

I just committed a slight variation on the above patch which should
fix that problem.

** TODO python :results value fails with result ending in newline
   This is a result of the fact that (in org-babel-number-p)

#+begin_src emacs-lisp 
(string-match "^-?[[:digit:]]*\\.?[[:digit:]]*$" "x\n")
#+end_src

#+results:
: 2

which is superficially surprising, but anyway, I think the regexp in
org-babel-number-p needs a tweak. Not quite sure exactly how though.

#+srcname: output
#+begin_src python :results value
  return "x\n"
#+end_src

#+results: output
: 0

*** Example
    Try M-x org-babel-execute-subtree with the subtree folded and
    point at the beginning of the heading line. The 7 output doesn't
    appear and the 6 output ends up outside the folded heading.
#+begin_src sh
echo 7
#+end_src

#+begin_src sh
echo 6
#+end_src

#+results:
: 6

** DONE python doesn't work with multiple statements per line
   Solved by demanding return statement in python.

   example on list
   This is because python statements are broken up by newlines in org-babel-python-evaluate.

   I think this is a somewhat uncomfortable issue. Both perl and
   python demand a return statement.

   Edit: Not true for perl
   
   That currently means that we have to separate the code into
   "statements" (not sure that's the right term), in order to stick a
   "return" in front of the last one. But in general, I think you
   would have to parse the language in order to know how to break the
   language up in this way. It's easy to come up with examples of
   valid python code, involving mutliline statements and/or semicolons
   that don't work in current org-babel. E.g.

#+begin_src python 
  def f(x,y):
      return x + y
  a = f(4,
        5)
  return a ## Added return statement to demonstrate solution
#+end_src

#+results:
: 9
** General Tests
Evaluate all the cells in this table for a comprehensive test of the
org-babel functionality.

*Note*: if you have customized =org-babel-default-header-args= then some
of these tests may fail.

#+TBLNAME: org-babel-tests
| functionality           | block                      | arg |    expected |     results | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| basic evaluation        |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| emacs lisp              | basic-elisp                |     |           5 |           5 | pass |
| shell                   | basic-shell                |     |           6 |           6 | pass |
| ruby                    | basic-ruby                 |     |   org-babel |   org-babel | pass |
| python                  | basic-python               |     | hello world | hello world | pass |
| R                       | basic-R                    |     |          13 |          13 | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| tables                  |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| emacs lisp              | table-elisp                |     |           3 |           3 | pass |
| ruby                    | table-ruby                 |     |       1-2-3 |       1-2-3 | pass |
| python                  | table-python               |     |           5 |           5 | pass |
| R                       | table-R                    |     |         3.5 |         3.5 | pass |
| R: col names in R       | table-R-colnames           |     |          -3 |          -3 | pass |
| R: col names in org     | table-R-colnames-org       |     |         169 |         169 | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| source block references |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| all languages           | chained-ref-last           |     |       Array |       Array | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| source block functions  |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| emacs lisp              | defun-fibb                 |     |       fibbd |       fibbd | pass |
| run over                | test-fibonacci             |   0 |           1 |           1 | pass |
| a                       | test-fibonacci             |   1 |           1 |           1 | pass |
| variety                 | test-fibonacci             |   2 |           2 |           2 | pass |
| of                      | test-fibonacci             |   3 |           3 |           3 | pass |
| different               | test-fibonacci             |   4 |           5 |           5 | pass |
| arguments               | test-fibonacci             |   5 |           8 |           8 | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| bugs and tasks          |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| simple ruby arrays      | ruby-array-test            |     |           3 |           3 | pass |
| R number evaluation     | bug-R-number-evaluation    |     |           2 |           2 | pass |
| multi-line ruby blocks  | multi-line-ruby-test       |     |           2 |           2 | pass |
| forcing vector results  | test-forced-vector-results |     |       Array |       Array | pass |
| deeply nested arguments | deeply-nested-args-bug     |     |           4 |           4 | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| sessions                |                            |     |             |             | pass |
|-------------------------+----------------------------+-----+-------------+-------------+------|
| set ruby session        | set-ruby-session-var       |     |        :set |        :set | pass |
| get from ruby session   | get-ruby-session-var       |     |           3 |           3 | pass |
| set python session      | set-python-session-var     |     |         set |         set | pass |
| get from python session | get-python-session-var     |     |           4 |           4 | pass |
| set R session           | set-R-session-var          |     |         set |         set | pass |
| get from R session      | get-R-session-var          |     |           5 |           5 | pass |
#+TBLFM: $5='(if (= (length $3) 1) (progn (message (format "running %S" '(sbe $2 (n $3)))) (sbe $2 (n $3))) (sbe $2))::$6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))
#+TBLFM: $5=""::$6=""

The second TBLFM line can be used to blank out the table results, in
the absence of a better method.

** Clojure Tests
Evaluate all the cells in this table for a comprehensive test of the
org-babel functionality.

*Note*: if you have customized =org-babel-default-header-args= then some
of these tests may fail.

#+TBLNAME: org-babel-clojure-tests
| functionality            | block                    | arg |                          expected |                           results | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| basic evaluation         |                          |     |                                   |                                   | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | basic-clojure            |     |                                 5 |                                 5 | pass |
| clojure                  | hello-clojure            |     |                     hello clojure |                     hello clojure | pass |
| ruby                     | basic-ruby               |     |                         org-babel |                         org-babel | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| tables                   |                          |     |                                   |                                   | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | table-clojure            |     |                                 3 |                                 3 | pass |
| clojure                  | table-clojure-join       |     |                             1-2-3 |                             1-2-3 | pass |
| ruby                     | table-ruby               |     |                             1-2-3 |                             1-2-3 | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| source block references  |                          |     |                                   |                                   | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| all languages            | clojure-chained-ref-last |     | class clojure.lang.PersistentList | class clojure.lang.PersistentList | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| source block functions   |                          |     |                                   |                                   | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| clojure                  | defn-fib                 |     |                        #'user/fib |                        #'user/fib | pass |
| clojure arg1             | clojure-fibonacci        |   0 |                                 0 |                                 0 | pass |
| clojure arg2             | clojure-fibonacci        |   1 |                                 1 |                                 1 | pass |
| clojure arg3             | clojure-fibonacci        |   3 |                                 2 |                                 2 | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| sessions                 |                          |     |                                   |                                   | pass |
|--------------------------+--------------------------+-----+-----------------------------------+-----------------------------------+------|
| set ruby session         | set-python-session-var   |     |                               set |                               set | pass |
| get from ruby session    | get-python-session-var   |     |                                 4 |                                 4 | pass |
| set clojure session      | set-clojure-session-var  |     |                              :set |                              :set | pass |
| get from clojure session | get-clojure-session-var  |     |                                 3 |                                 3 | pass |
#+TBLFM: $5='(if (= (length $3) 1) (progn (message (format "running %S" '(sbe $2 (n $3)))) (sbe $2 (n $3))) (sbe $2))::$6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))
#+TBLFM: $5=""::$6=""

